app/Http/Controllers/API/BoxController.php

select * from `boxes`
---
    final public function index(): ResourceCollection
    {
        return BoxResource::collection(Box::all());