app/Http/Controllers/API/SearchController.php

select * from `items` where `name` LIKE '%asd%'
---
    public function index(Request $request)
    {
        $searchTerm = $request->searchTerm;

        $items = Item::query()
            ->when($searchTerm, function ($q) use ($searchTerm) {
                $q->where('name', 'LIKE', '%' . $searchTerm . '%');
            })
            ->get();