app/Http/Controllers/API/TeamController.php

select `teams`.*, `team_users`.`user_id` as `pivot_user_id`, `team_users`.`team_id` as `pivot_team_id`, `team_users`.`created_at` as `pivot_created_at`, `team_users`.`updated_at` as `pivot_updated_at`, `team_users`.`is_default` as `pivot_is_default` from `teams` inner join `team_users` on `teams`.`id` = `team_users`.`team_id` where `team_users`.`user_id` = 1
---
    public function index()
    {
        $team = auth()->user()->team->load('users');